---
kind: type
id: T:Autodesk.Revit.DB.DimensionShape
source: html/4ed85868-6ad0-6fdb-c648-6f7ee7738fd2.htm
---
# Autodesk.Revit.DB.DimensionShape

An enumerated type to list dimension type.

## Syntax (C#)
```csharp
public enum DimensionShape
```